---
kind: method
id: M:Autodesk.Revit.DB.PointCloudInstance.GetRegions
source: html/6fd8f8f6-a0e1-c34f-fc82-4f72cea2aa81.htm
---
# Autodesk.Revit.DB.PointCloudInstance.GetRegions Method

Returns array of region names.

## Syntax (C#)
```csharp
public IList<string> GetRegions()
```

## Returns
Resulting array of region names.